In [1]:
import pandas as pd

## File

In [24]:
df = pd.read_csv('train.csv')

In [25]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
df = pd.read_excel('Employee data.xls', sheet_name=0)

In [27]:
df.head()

,id,gender,bdate,educ,jobcat,salary,salbegin,jobtime,prevexp,minority
0,1,m,1952-02-03,15,3,57000,27000,98,144,0
1,2,m,1958-05-23,16,1,40200,18750,98,36,0
2,3,f,1929-07-26,12,1,21450,12000,98,381,0
3,4,f,1947-04-15,8,1,21900,13200,98,190,0
4,5,m,1955-02-09,15,1,45000,21000,98,138,0

## Database

In [ ]:
from sqlalchemy import create_engine
uri = 'mongodb://ufk2vps0a7j:p7bb9de7d5fa58cb72a105ae756813ba7'
      '@ec2-38-129-168-191.compute-1.amazonaws.com:5432/deu4neob640'
engine = create_engine(uri)
conn = engine.raw_connection()

In [20]:
import sqlite3
conn = sqlite3.connect("flights.db")
# airports, airlines, and routes

In [21]:
query = "SELECT * FROM airports"

In [22]:
df = pd.read_sql_query(query, con=conn)

In [23]:
df.head()

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

## API

In [50]:
import requests
api_key = '3e3549aba4a6d288ce'
endpoint = f'http://www.apilayer.net/api/live?access_key={api_key}&format=1'

In [51]:
response = requests.get(endpoint)
response.status_code

200

In [53]:
import json
json_string = response.content.decode('utf-8')
data = json.loads(json_string)

In [54]:
data.keys()

dict_keys(['success', 'terms', 'privacy', 'timestamp', 'source', 'quotes'])

In [70]:
df = pd.DataFrame()
df['Currency'] = data['quotes'].keys()
df['Exchange Rate'] = data['quotes'].values()
df['Timestamp'] = data['timestamp']

In [71]:
df.head()

  Currency  Exchange Rate   Timestamp
0   USDAED       3.673150  1548837546
1   USDAFN      75.764505  1548837546
2   USDALL     109.000097  1548837546
3   USDAMD     486.040074  1548837546
4   USDANG       1.785250  1548837546

In [72]:
df.Currency.apply(len).value_counts()

6    168
Name: Currency, dtype: int64

In [75]:
df['Source'] = df.Currency.apply(lambda x: x[:3])
df['Target'] = df.Currency.apply(lambda x: x[3:])
df['Date'] =  pd.to_datetime(df.Timestamp, unit='s', utc=True)

In [76]:
df.head()

  Currency  Exchange Rate   Timestamp Source Target                      Date
0   USDAED       3.673150  1548837546    USD    AED 2019-01-30 08:39:06+00:00
1   USDAFN      75.764505  1548837546    USD    AFN 2019-01-30 08:39:06+00:00
2   USDALL     109.000097  1548837546    USD    ALL 2019-01-30 08:39:06+00:00
3   USDAMD     486.040074  1548837546    USD    AMD 2019-01-30 08:39:06+00:00
4   USDANG       1.785250  1548837546    USD    ANG 2019-01-30 08:39:06+00:00

In [77]:
df['Date'] = df.Date.dt.strftime('%Y-%m-%d')

In [78]:
df.head()

  Currency  Exchange Rate   Timestamp Source Target        Date
0   USDAED       3.673150  1548837546    USD    AED  2019-01-30
1   USDAFN      75.764505  1548837546    USD    AFN  2019-01-30
2   USDALL     109.000097  1548837546    USD    ALL  2019-01-30
3   USDAMD     486.040074  1548837546    USD    AMD  2019-01-30
4   USDANG       1.785250  1548837546    USD    ANG  2019-01-30

## Web Scraping

In [79]:
import requests
website = 'http://www.hubertiming.com/results/2017GPTR10K'

In [86]:
response = requests.get(website)
response.status_code

200

In [87]:
from bs4 import BeautifulSoup
html = BeautifulSoup(response.content, 'lxml')

In [106]:
individual_results = html.find(attrs={
    'id': 'individualResults'
})

In [108]:
table_headers = individual_results.find_all('th')
table_headers = [h.text for h in table_headers]

In [109]:
table_headers

['Place',
 'Bib',
 'Name',
 'Gender',
 'City',
 'State',
 'Chip Time',
 'Chip Pace',
 'Gender Place',
 'Age Group',
 'Age Group Place',
 'Time to Start',
 'Gun Time',
 'Team']

In [112]:
table_rows = individual_results.find_all('tr')

In [113]:
data = [[element.text for element in row.find_all('td')] for row in table_rows]

In [115]:
df = pd.DataFrame(data)

In [121]:
df.columns = table_headers

In [119]:
df.drop(0, axis=0, inplace=True)

In [122]:
df.head()

,Place,Bib,Name,Gender,City,State,Chip Time,Chip Pace,Gender Place,Age Group,Age Group Place,Time to Start,Gun Time,Team
1,1,814,JARED WILSON,M,TIGARD,OR,00:36:21,05:51,1 of 414,M 36-45,1 of 152,00:00:03,00:36:24,
2,2,573,NATHAN A SUSTERSIC,M,PORTLAND,OR,00:36:42,05:55,2 of 414,M 26-35,1 of 154,00:00:03,00:36:45,INTEL TEAM F
3,3,687,FRANCISCO MAYA,M,PORTLAND,OR,00:37:44,06:05,3 of 414,M 46-55,1 of 64,00:00:04,00:37:48,
4,4,623,PAUL MORROW,M,BEAVERTON,OR,00:38:34,06:13,4 of 414,M 36-45,2 of 152,00:00:03,00:38:37,
5,5,569,DEREK G OSBORNE,M,HILLSBORO,OR,00:39:21,06:20,5 of 414,M 26-35,2 of 154,00:00:03,00:39:24,INTEL TEAM F

# Another example

In [1]:
import requests
website = 'https://www.cntraveler.com/gallery/best-bars-in-paris'

In [2]:
response = requests.get(website)
response.status_code

200

In [3]:
from bs4 import BeautifulSoup
html = BeautifulSoup(response.content, 'lxml')

In [4]:
restaurants_html = html.find_all('section', {
    'class': 'gallery-item'
})
print(len(restaurants_html))

22

In [13]:
from pprint import pprint
pprint(restaurants_html[0].prettify())

('<section class="gallery-item gallery-item-venue" data-reactid="142">\n'
 ' <div class="gallery-item-image__container" data-reactid="143">\n'
 '  <picture class="component-responsive-image gallery-item-image__container" '
 'data-reactid="144">\n'
 '   <source data-reactid="145" media="(min-width: 1280px)" '
 'srcset="https://media.cntraveler.com/photos/5ab293f060ef3f51835c5ca5/master/w_820,c_limit/Bar-Hemingway-%25C2%25A9-Vincent-Leroux-(1).jpg"/>\n'
 '   <source data-reactid="146" media="(min-width: 768px)" '
 'srcset="https://media.cntraveler.com/photos/5ab293f060ef3f51835c5ca5/master/w_770,c_limit/Bar-Hemingway-%25C2%25A9-Vincent-Leroux-(1).jpg"/>\n'
 '   <source data-reactid="147" media="(min-width: 0px)" '
 'srcset="https://media.cntraveler.com/photos/5ab293f060ef3f51835c5ca5/master/w_420,c_limit/Bar-Hemingway-%25C2%25A9-Vincent-Leroux-(1).jpg"/>\n'
 '   <img alt="Bar Hemingway Ritz Hotel Paris" data-reactid="148" '
 'src="https://media.cntraveler.com/photos/5ab293f060ef3f51835c5ca5/master/w_420,c_limit/Bar-Hemingway-%25C2%25A9-Vincent-Leroux-(1).jpg" '
 'title=""/>\n'
 '  </picture>\n'
 ' </div>\n'
 ' <p class="credit" data-reactid="149">\n'
 '  Vincent Leroux\n'
 ' </p>\n'
 ' <div data-reactid="150">\n'
 '  <div class="image-content-container" data-reactid="151">\n'
 '   <p class="type" data-reactid="152">\n'
 '    bar\n'
 '   </p>\n'
 '   <a data-reactid="153" href="/bars/paris/bar-hemingway">\n'
 '    <h2 class="hed" data-reactid="154">\n'
 '     Bar Hemingway\n'
 '    </h2>\n'
 '   </a>\n'
 '   <div class="ratings" data-reactid="155">\n'
 '    <p class="price" data-reactid="156">\n'
 '     $$\n'
 '    </p>\n'
 '   </div>\n'
 '   <div class="dek" data-reactid="157">\n'
 '    <div data-reactid="158">\n'
 '     <p data-reactid="159">\n'
 '      Despite having received a facelift after a multi-million renovation, '
 'the place known for being liberated from the Nazis by author Ernest '
 'Hemingway retains its old-world charm with tufted leather banquettes and bar '
 "stools. Another thing that, thankfully, hasn't changed: legendary head "
 'barman Colin Field. The bon vivant, decked out in a white dinner jacket '
 '(complete with his name embroidered on the pocket), gleefully places your '
 'drinks, each with their own scented red or pink rose, before you while '
 'looking deep into your eyes (and seemingly your soul). Despite having '
 'created the menu—which is full of twists-on-classics such as the Clean Dirty '
 'Martini, served with a frozen cube of olive juice, and the Ritz Pimms with, '
 'of course, many secret ingredients in addition to ginger ale, Champagne, and '
 'garnishes of fruit, cucumber, fresh mint and griottine cherries—he’d much '
 'rather just choose for you. And once under his Sir-Mix-A lot spell you’ll '
 'likely just say OK.\n'
 '     </p>\n'
 '    </div>\n'
 '   </div>\n'
 '  </div>\n'
 ' </div>\n'
 '</section>\n')

In [14]:
first_rest = restaurants_html[0]

### Restaurant picture

In [22]:
tag = first_rest.find('source')
tag

In [19]:
tag.attrs['srcset']

'https://media.cntraveler.com/photos/5ab293f060ef3f51835c5ca5/master/w_820,c_limit/Bar-Hemingway-%25C2%25A9-Vincent-Leroux-(1).jpg'

In [24]:
image_url = first_rest.find('source').attrs['srcset']
image_url

'https://media.cntraveler.com/photos/5ab293f060ef3f51835c5ca5/master/w_820,c_limit/Bar-Hemingway-%25C2%25A9-Vincent-Leroux-(1).jpg'

### Restaurant name

In [25]:
tag = first_rest.find('h2')
tag

In [27]:
tag.text

'Bar Hemingway'

In [29]:
rest_name = first_rest.find('h2').text
rest_name

'Bar Hemingway'

### Price

In [31]:
tag = first_rest.find('p', {'class': 'price'})
tag

In [32]:
tag.text

'$$'

In [47]:
rest_price = first_rest.find('p', {'class': 'price'}).text
rest_price

'$$'

### Restaurant description

In [42]:
tag = first_rest.find('div', {'class': 'dek'})
tag

<div class="dek" data-reactid="157"><div data-reactid="158"><p data-reactid="159">Despite having received a facelift after a multi-million renovation, the place known for being liberated from the Nazis by author Ernest Hemingway retains its old-world charm with tufted leather banquettes and bar stools. Another thing that, thankfully, hasn't changed: legendary head barman Colin Field. The bon vivant, decked out in a white dinner jacket (complete with his name embroidered on the pocket), gleefully places your drinks, each with their own scented red or pink rose, before you while looking deep into your eyes (and seemingly your soul). Despite having created the menu—which is full of twists-on-classics such as the Clean Dirty Martini, served with a frozen cube of olive juice, and the Ritz Pimms with, of course, many secret ingredients in addition to ginger ale, Champagne, and garnishes of fruit, cucumber, fresh mint and griottine cherries—he’d much rather just choose for you. And once under his Sir-Mix-A lot spell you’ll likely just say OK.</p></div></div>

In [43]:
tag.text

"Despite having received a facelift after a multi-million renovation, the place known for being liberated from the Nazis by author Ernest Hemingway retains its old-world charm with tufted leather banquettes and bar stools. Another thing that, thankfully, hasn't changed: legendary head barman Colin Field. The bon vivant, decked out in a white dinner jacket (complete with his name embroidered on the pocket), gleefully places your drinks, each with their own scented red or pink rose, before you while looking deep into your eyes (and seemingly your soul). Despite having created the menu—which is full of twists-on-classics such as the Clean Dirty Martini, served with a frozen cube of olive juice, and the Ritz Pimms with, of course, many secret ingredients in addition to ginger ale, Champagne, and garnishes of fruit, cucumber, fresh mint and griottine cherries—he’d much rather just choose for you. And once under his Sir-Mix-A lot spell you’ll likely just say OK."

In [48]:
rest_desc = first_rest.find('div', {'class': 'dek'}).text
rest_desc

"Despite having received a facelift after a multi-million renovation, the place known for being liberated from the Nazis by author Ernest Hemingway retains its old-world charm with tufted leather banquettes and bar stools. Another thing that, thankfully, hasn't changed: legendary head barman Colin Field. The bon vivant, decked out in a white dinner jacket (complete with his name embroidered on the pocket), gleefully places your drinks, each with their own scented red or pink rose, before you while looking deep into your eyes (and seemingly your soul). Despite having created the menu—which is full of twists-on-classics such as the Clean Dirty Martini, served with a frozen cube of olive juice, and the Ritz Pimms with, of course, many secret ingredients in addition to ginger ale, Champagne, and garnishes of fruit, cucumber, fresh mint and griottine cherries—he’d much rather just choose for you. And once under his Sir-Mix-A lot spell you’ll likely just say OK."

### Detail URL

In [50]:
tag = first_rest.find('a')
tag

In [51]:
tag.attrs['href']

'/bars/paris/bar-hemingway'

In [52]:
rest_url = first_rest.find('a').attrs['href']
rest_url

'/bars/paris/bar-hemingway'

## Restaurant Detail

In [36]:
website = f'https://www.cntraveler.com{rest_url}'
response = requests.get(website)
response.status_code

200

In [37]:
from bs4 import BeautifulSoup
html = BeautifulSoup(response.content, 'lxml')

In [40]:
coords = html.find('div', {'class': 'mapbox'})
coords

In [41]:
latitude = coords.attrs['data-lat']
longitude = coords.attrs['data-lng']

## All together

In [44]:
import requests
website = 'https://www.cntraveler.com/gallery/best-bars-in-paris'
response = requests.get(website)
response.status_code

200

In [45]:
from bs4 import BeautifulSoup
html = BeautifulSoup(response.content, 'lxml')
restaurants_html = html.find_all('section', {
    'class': 'gallery-item'
})
print(len(restaurants_html))

22

In [53]:
from tqdm import tqdm

In [70]:
rest_data = []
for r in tqdm(restaurants_html):
    image_url = r.find('source').attrs.get('srcset') if r.find('source') else None
    rest_name = r.find('h2').text
    rest_price = r.find('p', {'class': 'price'}).text
    rest_desc = r.find('div', {'class': 'dek'}).text
    rest_url = r.find('a').attrs.get('href')
    
    website = f'https://www.cntraveler.com{rest_url}'
    response = requests.get(website)
    html = BeautifulSoup(response.content, 'lxml')
    coords = html.find('div', {'class': 'mapbox'})
    latitude = coords.attrs.get('data-lat')
    longitude = coords.attrs.get('data-lng')
    
    rest_data.append({
        'image_url': image_url,
        'name': rest_name,
        'price': rest_price,
        'desc': rest_desc,
        'url': website,
        'latitude': latitude,
        'longitude': longitude
    })

100%|██████████| 22/22 [00:17<00:00,  1.26it/s]

In [71]:
import pandas as pd
restaurants = pd.DataFrame(rest_data)

In [61]:
restaurants.head()

,desc,image_url,latitude,longitude,name,price,url
0,Despite having received a facelift after a mul...,https://media.cntraveler.com/photos/5ab293f060...,48.8680922,2.3266494,Bar Hemingway,$$,/bars/paris/bar-hemingway
1,There's no menu at this small bar off the boul...,https://media.cntraveler.com/photos/5a81e9a486...,48.8640676,2.3636478,Bisou,$$,/bars/paris/bisou
2,"Your first thought will be, ""Am I in the right...",https://media.cntraveler.com/photos/5a81e9a71e...,48.8557066,2.369005,Moonshiner,$$,/bars/paris/moonshiner
3,"Since opening in the haute Marais in 2013, it’...",https://media.cntraveler.com/photos/5a80a85da2...,48.8617412,2.3628237,Le Mary Celeste,$$,/restaurants/paris/le-mary-celeste
4,Opened by Experimental Cocktail Club protégée ...,https://media.cntraveler.com/photos/5a81e9a98e...,48.8637362,2.3614976,Little Red Door,$$,/bars/paris/little-red-door

In [75]:
pd.set_option('display.max_colwidth', 130)

In [78]:
restaurants.head()

,desc,image_url,latitude,longitude,name,price,url
0,"Despite having received a facelift after a multi-million renovation, the place known for being liberated from the Nazis by aut...","https://media.cntraveler.com/photos/5ab293f060ef3f51835c5ca5/master/w_820,c_limit/Bar-Hemingway-%25C2%25A9-Vincent-Leroux-(1).jpg",48.8680922,2.3266494,Bar Hemingway,$$,https://www.cntraveler.com/bars/paris/bar-hemingway
1,There's no menu at this small bar off the boulevard in the Haute Marais. It's all about what you like—and what the bartender f...,"https://media.cntraveler.com/photos/5a81e9a486e4b63c297d47a9/master/w_820,c_limit/Bisou14-%25C2%25A9-Ronan-Le-May.jpg",48.8640676,2.3636478,Bisou,$$,https://www.cntraveler.com/bars/paris/bisou
2,"Your first thought will be, ""Am I in the right place?"" and ""Can I order a slice or do I have to get a whole pie?"" The bar's lo...","https://media.cntraveler.com/photos/5a81e9a71eb1e03b9678c16d/master/w_820,c_limit/Moonshiner_DSC_2734.jpg",48.8557066,2.369005,Moonshiner,$$,https://www.cntraveler.com/bars/paris/moonshiner
3,"Since opening in the haute Marais in 2013, it’s become a real neighborhood hotspot for both locals and visitors who come as mu...","https://media.cntraveler.com/photos/5a80a85da2fdaf4c74bb5f50/master/w_820,c_limit/Le-Mary-Celeste_Fabien-Voileau_2018_opt-9939...",48.8617412,2.3628237,Le Mary Celeste,$$,https://www.cntraveler.com/restaurants/paris/le-mary-celeste
4,"Opened by Experimental Cocktail Club protégée Timothée Prangé and Dotan Shalev (who also own the newer Lulu White in Pigalle),...","https://media.cntraveler.com/photos/5a81e9a98ea5f04e2cf7739a/master/w_820,c_limit/The-Red-Door_LRD-interior-%25C2%25A9Maxime-P...",48.8637362,2.3614976,Little Red Door,$$,https://www.cntraveler.com/bars/paris/little-red-door